
        Dcl-Pr callfunc Pointer ExtProc;
          pProc Pointer;
          pArgv Pointer Dim(256);
          pArgc Uns(3);
          pByte Uns(5) Const;
        End-Pr;