PGM PARM(&NAME &HOST &PORT)
  DCL &NAME TYPE(*CHAR) LEN(10)
  DCL &HOST TYPE(*CHAR) LEN(15)
  DCL &PORT TYPE(*INT)  LEN(4)
  
  DCL &TYPE TYPE(*CHAR) LEN(1)
  
  RTVJOBA TYPE(&TYPE)
  
  IF (&TYPE *EQ '1') THEN(DO)

	SBMJOB CMD(STRILESRV JOB(&NAME) HOST(&HOST) PORT(&PORT)) +
           JOB(&NAME) +
	       JOBQ(QSYSNOMAX) ALWMLTTHD(*YES)
  ENDDO
  ELSE (DO)
    CALL PGM(ILEUSION) PARM(&HOST &PORT)
  ENDDO
   
ENDPGM